#1、有一个列表，[“北京”,”上海”,”广东”]
# 1)	将中国所有省会城市添加到上述列表中
'''
list=["北京","上海","广东"]
for i in range (31):
  name = input("请输入其他省份城市")
  list.append(name)
print(list)
'''


# 2)	广东成为第二大发达城市，将广东排在上海前面
'''
list = ["北京","上海","广东"]
list[1] = "广东"
list[2] = "上海"
print(list)
'''
# 3)	[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]这是中国GDP排名前8的城市的GDP数值，请统计前8城市的GDP总和，平均GDP。
'''
list=[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
n=0
for i in range (7):
  n=n+list[i]
print(n)
'''



#2、有以下一个列表，求其中是5的倍数的和
'''
a = [1,5,21,30,15,9,30,24]
a = [1, 5, 21, 30, 15, 9, 30, 24]
result = 0
for i in range(len(a)):
    if a[i] % 5 == 0:
        result += a[i]
    else:
        continue

print(result)

dict1 = {
    'first': 1,
    'second': 2,
    'third': 3,
}
for m, n in dict1.items():
    print(m, n)
'''




#3、有下列列表，请编程实现列表的数据翻转（京东金融的测试开发笔试题）
# List = [1,2,3,4,5,6,7,8,9]
# 实现效果：list = [9,8,7,6,5,4,3,2,1]
'''
List=[1,2,3,4,5,6,7,8,9,]
list=List[::-1]  #从倒数最后一个数字往前进行降值输出
print(list)
'''


# 4、请编程统计列表中的每个数字出现的次数(百度初级测试开发笔试题)
# List = [1,4,7,5,8,2,1,3,4,5,9,7,6,1,10]
'''
List = [1,4,7,5,8,2,1,3,4,5,9,7,6,1,10]
a = set(List)
for n in a:
    print(f"数字{n}出现了{List.count(n)}次！！！")
'''